# Target Guided Ordinal Encoding

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({'city' : ['new york' , 'london' , 'paris' , 'japan ' , 'new york', 'paris'] , 
                  'price' : [200, 150 , 300 , 250, 180, 320]})
df

       city  price
0  new york    200
1    london    150
2     paris    300
3    japan     250
4  new york    180
5     paris    320

In [8]:
# calculate mean price each city

mean_price = df.groupby('city')['price'].mean().to_dict()
mean_price

{'japan ': 250.0, 'london': 150.0, 'new york': 190.0, 'paris': 310.0}

In [9]:
# replace each city with its mean price

df['city_encodin_mean'] = df['city'].map(mean_price)

In [10]:
df

       city  price  city_encodin_mean
0  new york    200              190.0
1    london    150              150.0
2     paris    300              310.0
3    japan     250              250.0
4  new york    180              190.0
5     paris    320              310.0

In [11]:
import seaborn as sns

In [25]:
t = sns.load_dataset('tips')

In [28]:
mean_tips = t.groupby('day')['total_bill'].mean().to_dict()
mean_tips

C:\Users\nusra\AppData\Local\Temp\ipykernel_23772\2118038234.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_tips = t.groupby('day')['total_bill'].mean().to_dict()

{'Thur': 17.682741935483868,
 'Fri': 17.15157894736842,
 'Sat': 20.44137931034483,
 'Sun': 21.41}

In [31]:
t['day_encoding'] = t['day'].map(mean_tips)

In [32]:
t

     total_bill   tip     sex smoker   day    time  size day_encoding
0         16.99  1.01  Female     No   Sun  Dinner     2    21.410000
1         10.34  1.66    Male     No   Sun  Dinner     3    21.410000
2         21.01  3.50    Male     No   Sun  Dinner     3    21.410000
3         23.68  3.31    Male     No   Sun  Dinner     2    21.410000
4         24.59  3.61  Female     No   Sun  Dinner     4    21.410000
..          ...   ...     ...    ...   ...     ...   ...          ...
239       29.03  5.92    Male     No   Sat  Dinner     3    20.441379
240       27.18  2.00  Female    Yes   Sat  Dinner     2    20.441379
241       22.67  2.00    Male    Yes   Sat  Dinner     2    20.441379
242       17.82  1.75    Male     No   Sat  Dinner     2    20.441379
243       18.78  3.00  Female     No  Thur  Dinner     2    17.682742

[244 rows x 8 columns]